In [57]:
import pandas as pd
import numpy as np
df=pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [6]:
df.shape

(6, 4)

In [7]:
df[:1]

        day  temperature  windspeed event
0  1/1/2017           32          6  Rain

In [8]:
df[1:1]

Empty DataFrame
Columns: [day, temperature, windspeed, event]
Index: []

In [9]:
df[2:5]

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [10]:
df[:]

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [11]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [12]:
df.columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [15]:
df.day

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [16]:
df['day']

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [17]:
type(df['event'])

pandas.core.series.Series

In [20]:
df[['event','windspeed']] # 2 columns in a dataframe

   event  windspeed
0   Rain          6
1  Sunny          7
2   Snow          2
3   Snow          7
4   Rain          4
5  Sunny          2

# Max temperature

In [22]:
df['temperature'].max()

35

In [23]:
df['temperature'].min()

24

In [25]:
df['temperature'].mean()

30.333333333333332

In [28]:
df.describe()

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

# Conditional formatting

In [29]:
df[df['temperature']==32]

        day  temperature  windspeed event
0  1/1/2017           32          6  Rain
4  1/5/2017           32          4  Rain

In [31]:
df[df['temperature']>32]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [32]:
df[df['temperature']<32]

        day  temperature  windspeed  event
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
5  1/6/2017           31          2  Sunny

In [38]:
df[df['temperature']==df['temperature'].max()]

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [45]:
df[['day','temperature']][df['temperature']==df['temperature'].max()]

        day  temperature
1  1/2/2017           35

In [55]:
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [56]:
df.set_index('day',inplace=True)
df

TypeError: 'Series' object is not callable

In [63]:
data=pd.DataFrame(df)
data

          temperature  windspeed  event
day
1/1/2017           32          6   Rain
1/2/2017           35          7  Sunny
1/3/2017           28          2   Snow
1/4/2017           24          7   Snow
1/5/2017           32          4   Rain
1/6/2017           31          2  Sunny

In [64]:
data.loc['1/1/2017']

temperature      32
windspeed         6
event          Rain
Name: 1/1/2017, dtype: object

In [70]:
data.iloc[2:3]

          temperature  windspeed event
day
1/3/2017           28          2  Snow

In [71]:
data.reset_index(inplace=True)
data

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [72]:
data.set_index('event',inplace=True)
data

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017           35          7
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7
Rain   1/5/2017           32          4
Sunny  1/6/2017           31          2

In [75]:
data.loc['Rain'] # acts as hash-key

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Rain   1/5/2017           32          4

In [80]:
data.dtypes # types of objects in a dataframe

day            object
temperature     int64
windspeed       int64
dtype: object

In [82]:
data

            day  temperature  windspeed
event
Rain   1/1/2017           32          6
Sunny  1/2/2017           35          7
Snow   1/3/2017           28          2
Snow   1/4/2017           24          7
Rain   1/5/2017           32          4
Sunny  1/6/2017           31          2

# 
iloc[:, ::2]: The iloc method is used to select rows and columns by index position.
: means select all rows.
::2 means select every second column starting from index 0 (the first column)

In [83]:
data.iloc[:,::2]

            day  windspeed
event
Rain   1/1/2017          6
Sunny  1/2/2017          7
Snow   1/3/2017          2
Snow   1/4/2017          7
Rain   1/5/2017          4
Sunny  1/6/2017          2

In [87]:
data.iloc[:,1::2] # : all rows, 1::2 means 1 is the 2nd column (0 means 1st column) and step up every 2nd one

       temperature
event
Rain            32
Sunny           35
Snow            28
Snow            24
Rain            32
Sunny           31